---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineOrigin
source: html/dd1c3ac3-28fc-d37d-b97d-dcf61e9c629d.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineOrigin Property

The origin point for the dimension line.

## Syntax (C#)
```csharp
public XYZ DimensionLineOrigin { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null